# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.
### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset

In [2]:
df=pd.read_csv("Alcohol_consumption.csv")
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 3. Assign it to a variable called drinks.

In [4]:
drinks=df.copy()
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [14]:
df.groupby("continent").agg({"beer_servings":"mean"}).sort_values("beer_servings", ascending=False)

           beer_servings
continent
EU            193.777778
SA            175.083333
OC             89.687500
AF             61.471698
AS             37.045455

In [23]:
a=df.groupby("continent").beer_servings.mean()
b=a.sort_values(ascending=False)
b

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [10]:
df.groupby("continent").agg({"wine_servings":["mean","sum", "count", "max", "min"]})

          wine_servings
                   mean   sum count  max min
continent
AF            16.264151   862    53  233   0
AS             9.068182   399    44  123   0
EU           142.222222  6400    45  370   0
OC            35.625000   570    16  212   0
SA            62.416667   749    12  221   1

In [24]:
df.groupby("continent").wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [25]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [ ]:
a=df.groupby('continent').agg({'beer_servings':'mean', 'spirit_servings':'mean', 'wine_servings':'mean'}).reset_index()
a['total_consumption']=a['beer_servings']+a['spirit_servings']+a['wine_servings']
a

  continent  beer_servings  spirit_servings  wine_servings  total_consumption
0        AF      61.471698        16.339623      16.264151          31.358491
1        AS      37.045455        60.840909       9.068182          35.651515
2        EU     193.777778       132.555556     142.222222         156.185185
3        OC      89.687500        58.437500      35.625000          61.250000
4        SA     175.083333       114.750000      62.416667         117.416667

In [26]:
df.groupby("continent").total_litres_of_pure_alcohol.mean().sort_values(ascending=False)

continent
EU    8.617778
SA    6.308333
OC    3.381250
AF    3.007547
AS    2.170455
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 7. Print the median alcohol consumption per continent for every column

In [27]:
df.groupby("continent").total_litres_of_pure_alcohol.median().sort_values(ascending=False)

continent
EU    10.00
SA     6.85
AF     2.30
OC     1.75
AS     1.20
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [ ]:
df.spirit_servings.describe().head()

count    193.000000
mean      80.994819
std       88.284312
min        0.000000
25%        4.000000
50%       56.000000
75%      128.000000
max      438.000000
Name: spirit_servings, dtype: float64

In [30]:
df.spirit_servings.agg(['mean','max', 'min'])

mean     80.994819
max     438.000000
min       0.000000
Name: spirit_servings, dtype: float64

In [34]:
df.groupby("continent").spirit_servings.agg(['mean', 'max', 'min'])

                 mean  max  min
continent
AF          16.339623  152    0
AS          60.840909  326    0
EU         132.555556  373    0
OC          58.437500  254    0
SA         114.750000  302   25